# -*- coding: utf-8 -*-
import pandas as pd
from ckonlpy.tag import Twitter
twitter = Twitter()

df = pd.read_csv('./outputs/df3_2_artsCleanEtc.csv')

print(df)
### DOCS : https://github.com/lovit/customized_konlpy

# 사전 키워드 추가
AddDictList = ['이직','업종','공부'
               'c언어','타입스크립트'
               'si','erp','PL','기술면접',
               '임금체불','지급명령','사장님',
               '앱개발','스타트업','인공지능'
               '사이버대학교','검정고시','워라벨',
               '비전공','서류제출',
               '패스트캠퍼스',
               '코드분석', '외부라이브러리','요구사항분석',
               '문제해결능력',
               '개인 프로젝트','개인프로젝트','상장 기업',
               '해외주식','기획안','재지원','회사선택','퇴근',
               '익스텐션','개발방법론','토이프로젝트',
               '보안관제','강의추천','비전공자','경력직',
               '수습기간','기술서적','노트정리','취업고민','개발시장','저장','일시불','재취업','출근가방','프로그래머스','코딩테스트','학사편입','데이터검증','신입지원','게이밍마우스','게이밍키보드','기초지식','고용보험','의무가입','웹개발','국책과제','학부생','기술스택',
               '게임 프로그래밍','데이터엔지니어','솔루션업체','첫출근','컴퓨터관련학과','국비교육학원','직무변경',
               '신입지원','신입준비','체험형인턴','타입체커','팀프로젝트','웹서비스','편입생','요금','개인블로그','딥러닝','공공데이터','자동배포','인수인계','상관관계','인과관계','정처기','빅분기','포토폴리오','네카라쿠배','개발직','관련알바','연봉협상','직장생활','전자정부프레임워크','안드로이드개발','신생기업','회사선택','입문용','노트북','줄야근','스프링부트','테스터','지방대','웹프로그래머','자율주행로봇','자율주행','선임개발자','물경력','시나리오기반','인텔리제이','이직사유','전산팀','국비교육지원','포지션변경','학원출신','홈페이지관리자','실무프로젝트','취직','모니터암','면접질문','데이터계열','정보처리산업기사','가성비','입문자','경력단절','해커톤','수상','가산점','연습사이트','프리랜서단가','고학점','문서작성','몇장','테스팅','지방대','보상앱','사용언어','교육센터','비양심','테크코스','네이버부스트캠프','유데미','인공지능학과','부전공','강남점','사이드프로젝트','공부방향','리엑트','클린코드','클린아키텍처','데이터사이언스','중소','웹퍼블리셔','디자인패턴','지원금','공공법','전화업무','맥북에어','선정기준','자바의정석','카카오클라우드스쿨','학습방향','면접결과','주차','중견기업','대기업','모기업','사례비','모집합','웹디자인기능사','데이터분석','기획자','소통법','스마트팩토리','삼성전자','카카오페이','이직','웹사이트','개인정보취급방침','연봉협상','채용공고','접속문제','학은제','학점은행제','지망생','온라인강의','사이트','운영','영세기업','워라밸','외국계기업','외국계','영문이력서','취업준비','공공데이터포탈','금전적','고객사','파견직','취준생','질문','풀스택','다양화','기술동향','중견','중견기업','내근직','예비개발자','발표면접','클론코딩','입문자','딥러닝개발자','국비교육과정','메가바이트스쿨','공고','레드오션','더미데이터','가스라이팅','취직','인공지능','봉급','쌍용교육센터','연습문제','메인업무','직종전환','코딩용','중하위','금융권','중후반','유지보수','변수선언','불안정','홍보처','경력개발자','그룹바이','설명회','엔지니어링','내일배움카드','모바일게임','수료후','한국소프트웨어산업협회','경력인정','플랫폼노동자','밀리패턴','전세자금대출','직무','채용설명회','주의사항','카카오모빌리티','스마트뱅킹','모바일뱅킹','준비생','서비스회사','개발직군','채용연계','데이터분석','에이블스쿨','인력부족','회사선택','공공근무','회사정책','웹프로그래머','멀티캠퍼스','깃','메타버스','유통업무','창업팀','개정전후','연장계약','구글플레이','스크롤','서류탈락','웹프론트엔드','코인거래소','인성검사','적성검사','업무강도','현직자','중장기','인공지능학과','확진자','영업이익','개발용','제로초','멋쟁이사자처럼','프론트엔드스쿨','엔지니어트랙','이직횟수','솔루션회사','개발부서','개발직군','효율적','인상률','임포트','실행파일','담당업무','백엔드','연봉인상','연봉인상률','레거시코드','해외송금','외국회사','대표님','기술지원','재설치','키오스크','종증세','비대면','재택근무','재택','블록체인','수강포기','머신러닝','비밀유지','취업금지','매직키보드','코드리뷰','요청수','복수전공','수습','비대면','훈련수당','포괄임금제','비포괄임금제','호버','반프리랜서','반프리','면접결과','주도권','제로베이스','오픈소스기여','연봉 협상','계약 파기','블라인드채용','첫회사','첫직장','네트워크관리사','업무환경','공부방향','소스코드','대용량'] 

twitter.add_dictionary(AddDictList,'Noun')


# post processor 활용
from ckonlpy.tag import Postprocessor

    # 1) N그램 복합명사
ngrams = [(('미스', '함무라비'), 'Noun'), ('바람', '의', '나라')]

    # 2) pass tag로 특정 품사만 출력
passtag = {'Noun'}

    # 3) stop words에 등록된 단어,품사 는 출력되지 않음
stopwords = {'는', '방법', '프로그램','직할'}

    # 4) replace로 치환
replace = {
           '프리':'프리랜서',
           '프리가':'프리랜서',
           
           'si':'si업체',
           '솔루션업체':'si업체',
           '솔루션회사':'si업체',
           
           '사장님':'사장',
           '대표님':'대표',
           ''
           
           '비전공': '비전공자',
           '타전공': '비전공자',
           
           '방통대': '방송통신대학교',
           '사이버대':'사이버대학교',
           '학은제':'학점은행제',
           
           '국비':'국비교육',
           '국비교육지원':'국비교육',
           '국비지원':'국비교육',
           '국비지원학원':'국비교육',
           '국비교육과정':'국비교육',
           
           '포폴': '포트폴리오',
           '포토폴리오':'포트폴리오',
           
           '프론트':'프론트엔드',
           '프론트앤드':'프론트엔드',
           '비전공자':'비전공',
           
           '컴공과':'컴공',
           '컴퓨터공학':'컴공',
           'cs':'컴공',
           
           '붓캠': '부트캠프',
           '부캠': '부트캠프',
           '패캠': '패스트캠퍼스',
           
           '온라인강의':'인강',
           
           '커리': '커리큘럼',
           '과정': '교육과정',
           
           '정처기':'정보처리기사',
           '빅분기':'빅데이터분석기사',
           
           '퀄러티': '퀄리티',
           '개인 프로젝트':'개인프로젝트',
           '플젝':'프로젝트',
           
           '학사편입': '편입',
           
           '리엑트': '리액트',
           '중소':'중소기업',
           '중소업체':'중소기업',
           '영세기업':'중소기업',
           '영세업체':'중소기업',
           '중견':'중견기업',
           
           '사이트':'웹사이트',
           
           '외국계':'외국계기업',
           '공공데이터포탈':'공공데이터',
           
           '공고':'모집공고',
           '봉급':'연봉',
           
           '직종전환':'이직',
           '엔지니어링':'엔지니어',
           
           '준비생':'취준생',
           
           '퍼블리셔': '웹퍼블리셔',
           '갤탭': '갤럭시탭',
           '패드': '태블릿',
           
           '커뮤': '커뮤니티',
           
           '풀스텍': '풀스택',
           
           '종증세': '종합증여세',
           '재택':'재택근무',
           '퍼블':'퍼블리싱',
           '직하':'직',
           
           '첫회사':'첫직장'
           
           }
# ~40
    # Postprocessor 생성
postprocessor = Postprocessor(twitter,
                              ngrams = ngrams,
                              passtags=passtag,
                              stopwords=stopwords,
                              replace=replace)


# 형태소 분석 테스트
test_series1 = df['comments'].map(lambda comments : 0 if (type(comments) != str) else postprocessor.pos(comments))

# Noun array만 저장
arr_noun_comment = []
for i in range(len(test_series1)):
    temp = []
    print(f'level1: {i}------------------')
    if test_series1[i] == 0:
        continue
    else:
        for j in range(len(test_series1[i])):
            temp.append(test_series1[i][j][0])
    arr_noun_comment.append(temp)

print(arr_noun_comment)

import numpy as np
np.save('./week2/arr3_noun_comments',arr_noun_comment)
 
